Ran Plan for 2 projects:

1. dir: `deployment/cloud` workspace: `default`
1. dir: `deployment/service/fta_users` workspace: `default`
---

### 1. dir: `deployment/cloud` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d deployment/cloud
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://fta-mstr-gce-atlantis:4141/lock?id=greyhats13%252Ffta_iac%252Fdeployment%252Fcloud%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d deployment/cloud
  ```

---
### 2. dir: `deployment/service/fta_users` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.google_project.curent: Read complete after 1s [id=projects/fta-platform]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.gsa.google_project_iam_member.sa_iam[0] will be created
+ resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "fta-platform"
      + role    = "roles/storage.objectViewer"
    }

  # module.gsa.google_project_iam_member.sa_iam[1] will be created
+ resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "fta-platform"
      + role    = "roles/cloudsql.client"
    }

  # module.gsa.google_service_account.gsa will be created
+ resource "google_service_account" "gsa" {
      + account_id   = "fta-dev-svc-users"
      + disabled     = false
      + display_name = "Service Account for fta-dev-svc-users service"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "fta-platform"
      + unique_id    = (known after apply)
    }

  # module.gsa.google_service_account_iam_binding.binding[0] will be created
+ resource "google_service_account_iam_binding" "binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:fta-platform.svc.id.goog[dev/fta-dev-svc-users]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.gsa.google_service_account_iam_binding.binding[1] will be created
+ resource "google_service_account_iam_binding" "binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:fta-platform.svc.id.goog[dev/fta-dev-svc-users]",
        ]
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # module.repo_users.github_actions_environment_variable.variable["chart_path"] will be created
+ resource "github_actions_environment_variable" "variable" {
      + created_at    = (known after apply)
      + environment   = "fta_users_dev"
      + id            = (known after apply)
      + repository    = "fta_users"
      + updated_at    = (known after apply)
      + value         = "incubator/fta_users"
      + variable_name = "chart_path"
    }

  # module.repo_users.github_actions_environment_variable.variable["docker_repository_uri"] will be created
+ resource "github_actions_environment_variable" "variable" {
      + created_at    = (known after apply)
      + environment   = "fta_users_dev"
      + id            = (known after apply)
      + repository    = "fta_users"
      + updated_at    = (known after apply)
      + value         = "greyhats13/fta_users"
      + variable_name = "docker_repository_uri"
    }

  # module.repo_users.github_actions_environment_variable.variable["gitops_repo_name"] will be created
+ resource "github_actions_environment_variable" "variable" {
      + created_at    = (known after apply)
      + environment   = "fta_users_dev"
      + id            = (known after apply)
      + repository    = "fta_users"
      + updated_at    = (known after apply)
      + value         = "greyhats13/fta_gitops"
      + variable_name = "gitops_repo_name"
    }

  # module.repo_users.github_actions_environment_variable.variable["repo_gitops_ssh"] will be created
+ resource "github_actions_environment_variable" "variable" {
      + created_at    = (known after apply)
      + environment   = "fta_users_dev"
      + id            = (known after apply)
      + repository    = "fta_users"
      + updated_at    = (known after apply)
      + value         = "git@github.com:greyhats13/fta_gitops.git"
      + variable_name = "repo_gitops_ssh"
    }

  # module.repo_users.github_actions_environment_variable.variable["service_name"] will be created
+ resource "github_actions_environment_variable" "variable" {
      + created_at    = (known after apply)
      + environment   = "fta_users_dev"
      + id            = (known after apply)
      + repository    = "fta_users"
      + updated_at    = (known after apply)
      + value         = "fta_users"
      + variable_name = "service_name"
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d deployment/service/fta_users
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://fta-mstr-gce-atlantis:4141/lock?id=greyhats13%252Ffta_iac%252Fdeployment%252Fservice%252Ffta_users%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d deployment/service/fta_users
  ```
Plan: 10 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 1 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```